app/Controllers/AuthController.php

    public function login()
    {
        $request = \Config\Services::request();
        $session = session();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'email_usuario' => 'required|valid_email',
            'pass_usuario'  => 'required|min_length[8]',
        ]);

        if (!$validation->withRequest($request)->run()) {
            return redirect()->back()->withInput()->with('validation', $validation->getErrors());
        }

        $userModel = new UsuarioModel();
        $user = $userModel->where('email_usuario', $request->getPost('email_usuario'))->first();
---
SELECT *
FROM `usuario`
WHERE `email_usuario` = 'tomascardozo@gmail.com'
 LIMIT 1