app/Controllers/ProductoController.php

    public function lista_productos()
    {
        $productoModel = new ProductoModel();
        $data['productos'] = $productoModel->findAll();
---
SELECT *
FROM `producto`

    public function guardar_producto()
    {
        $productoModel = new ProductoModel();

        $validation = \Config\Services::validation();

        $validation->setRules([
            'nombre_producto'       => 'required|max_length[255]',
            'descripcion_producto'  => 'required',
            'precio_producto'       => 'required|decimal',
            'stock_producto'        => 'required|integer',
            'id_categoria'          => 'required|integer',
            'estado_producto'       => 'required|in_list[0,1]',
            'img_producto'          => 'permit_empty|uploaded[img_producto]|is_image[img_producto]',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->back()->withInput()->with('validation', $validation->getErrors());
        }

        $img = $this->request->getFile('img_producto');
        $imgName = null;

        if ($img && $img->isValid() && !$img->hasMoved()) {
            $imgName = $img->getRandomName();
            $img->move(ROOTPATH . 'public/uploads/', $imgName);
        }

        $productoModel->insert([
            'nombre_producto'      => $this->request->getPost('nombre_producto'),
            'descripcion_producto' => $this->request->getPost('descripcion_producto'),
            'precio_producto'      => $this->request->getPost('precio_producto'),
            'stock_producto'       => $this->request->getPost('stock_producto'),
            'estado_producto'      => $this->request->getPost('estado_producto'),
            'id_categoria'         => $this->request->getPost('id_categoria'),
            'img_producto'         => $imgName
        ]);
---
INSERT INTO `producto` (`nombre_producto`, `descripcion_producto`, `precio_producto`, `stock_producto`, `estado_producto`, `id_categoria`, `img_producto`) VALUES ('Bombilla Mate Silver', 'Bombilla de alpaca con filtro desmontable. Diseño elegante con acabado plateado que no altera el sabor de tu mate.', '9000', '18', '1', '2', '1748468617_337dfff2b1542339976a.jpg')