app/Controllers/UsuarioController.php

    public function lista_usuarios()
    {
        $usuarioModel = new UsuarioModel();
        $data['usuarios'] = $usuarioModel->findAll();
---
SELECT *
FROM `usuario`